Repository: quarkusio/pt.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: pt_br

source: Run <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">dev mode</a> remotely with changes to local files immediately available in a containerize environment.
pt_br: Execute o <a href="{{site.baseurl}}/guides/maven-tooling#dev-mode">modo de desenvolvimento</a> remotamente com alterações em arquivos locais imediatamente disponíveis em um ambiente de conteinerização.

source: Run application using virtual threads
pt_br: Executar a aplicação utilizando threads virtuais

source: Run code on virtual threads using @RunOnVirtualThread
pt_br: Execute código em threads virtuais usando @RunOnVirtualThread

source: Running Native
pt_br: Executando em modo nativo

source: Running the above command should return the result below:
pt_br: A execução do comando acima deve retornar o resultado abaixo:

source: Running the build process in a container is also possible:
pt_br: Também é possível executar o processo de compilação num contêiner:

source: Running this command, should return the following result:
pt_br: Ao executar este comando, deverá obter o seguinte resultado:

source: SUBATOMIC<span class="light-blue">/</span>
pt_br: <span class="light-blue">SUBATÔMICO</span>/

source: SUPERSONIC<span class="light-blue">/</span>
pt_br: SUPERSÔNICO<span class=“light-blue”>/</span>

source: Sample Dockerfile for building with Gradle:
pt_br: Exemplo de Dockerfile para build com o Gradle:

source: Sample Dockerfile for building with Maven:
pt_br: Exemplo de Dockerfile para fazer o build com o Maven:

source: Sample multistage Dockerfile for building an image from `scratch`:
pt_br: Exemplo de Dockerfile de vários estágios para criar uma imagem a partir de `scratch`:

source: Save this file in `src/main/docker/Dockerfile.multistage` as it is not included in the getting started quickstart.
pt_br: Salve esse arquivo em `src/main/docker/Dockerfile.multistage`, uma vez que não está incluído no startup rápido.

source: Scheduler Reference
pt_br: Referência do Scheduler

source: Scheduling Clustered Tasks with Quartz
pt_br: Agendando tarefas clusterizadas com o Quartz

source: Scheduling Periodic Tasks
pt_br: Agendamento de Tarefas Periódicas

source: Schema Migration with Flyway
pt_br: Migração de esquemas com o Flyway

source: Schema Migration with Liquibase
pt_br: Migração de esquemas com o Liquibase

source: Scratch image support is experimental.
pt_br: O suporte de imagens scratch é experimental.

source: Scratch images should not be used in production without rigorous testing.
pt_br: As imagens Scratch não devem ser utilizadas em produção sem um teste rigoroso.

source: Seconds of auto refreshing certificate.
pt_br: Segundos de atualização automática do certificado.

source: Seconds of keeping alive interval for each client broker connection.
pt_br: Segundos de intervalo de manutenção ativa para cada conexão do broker do cliente.

source: Secure your web endpoints with authorizations.
pt_br: Proteja os seus Web Endpoints com autorizações.

source: Security
pt_br: Segurança

source: Security Customization
pt_br: Personalização de segurança

source: Security Integration
pt_br: Integração da segurança

source: Security Overview
pt_br: Visão geral de segurança

source: Security Testing
pt_br: Testes de segurança

source: Security with Basic authentication and JPA
pt_br: Segurança com autenticação básica e JPA

source: See current increments keys
pt_br: Ver as chaves atuais de incrementos

source: See the xref:container-image.adoc[Container Image guide] for more details.
pt_br: Consulte o link:container-image.html[Guia do container-image] para obter mais informações.

source: See xref:tip-quarkus-native-remote-container-build[Creating a Linux executable without GraalVM installed] for more details.
pt_br: Veja link:#tip-quarkus-native-remote-container-build[Criando um executável Linux sem o GraalVM instalado] para mais detalhes.

source: Select the target architecture. You can select more than one to build multi-archs images.
pt_br: Selecione a arquitetura de destino. Você pode selecionar mais do que uma para criar imagens multiarquitetura.

source: Sending Emails using SMTP
pt_br: Enviando e-mails usando SMTP

source: Separating Java and native image compilation
pt_br: Separando a compilação de imagens nativas e Java

source: September 24, 2019
pt_br: 24 de setembro de 2019

source: Serialization
pt_br: Serialização

source: Server configuration
pt_br: Configurando servidor

source: Server configuration example
pt_br: Exemplo de configuração do servidor

source: Service discovery and load balancing with Stork
pt_br: Descoberta de serviços e balanceamento de carga com o Stork

source: Session Abstracts
pt_br: Resumos das Sessões

source: Set
pt_br: Conjunto

source: Set TLS using KeyStore way.
pt_br: Defina o TLS usando o modo KeyStore.

source: Set of TLS Ciphers.
pt_br: Conjunto de cifras TLS.

source: Set the value associated with the given key
pt_br: Define o valor associado a uma determinada chave

source: Setting it up
pt_br: Configuração

source: Setting the port
pt_br: Definindo a porta

source: Shared broker
pt_br: broker compartilhado

source: Shared cluster
pt_br: Cluster compartilhado

source: Simple SAM Local Principal
pt_br: Principal local SAM simples

source: Simple code
pt_br: Código simples

source: Simplified Hibernate ORM with Panache
pt_br: Hibernate ORM simplificado com Panache

source: Simplified Hibernate ORM with Panache and Kotlin
pt_br: Hibernate ORM simplificado com Panache e Kotlin

source: Simplified Hibernate Reactive with Panache
pt_br: Hibernate Reativo Simplificado com Panache

source: Simplified reactive ORM layer based on Hibernate Reactive.
pt_br: Camada ORM reativa simplificada baseada no Hibernate Reactive.

source: Simplify command line applications creation with the Picocli extension.
pt_br: Simplifique a criação de aplicativos de linha de comando com a extensão Picocli.

source: Simulate AWS Lambda Deployment with SAM CLI
pt_br: Simular o AWS Lambda Deployment com a CLI do SAM

source: Since virtual threads are disposable entities, the fundamental idea of `@RunOnVirtualThread` is to offload the execution of an endpoint handler on a new virtual thread instead of running it on an event-loop or worker thread (in the case of RESTEasy Reactive).
pt_br: Como as threads virtuais são entidades descartáveis, a ideia fundamental do `@RunOnVirtualThread` é descarregar a execução de uma requisição para um determinado endpoint em uma nova thread virtual em vez de executá-la em um loop de eventos ou em uma worker thread (no caso do RESTEasy Reactive).

source: Since we’re not limited to standards we can go beyond and extend your possibilities. Of course, Quarkus is not a passive consumer. Our goal is to improve and innovate the technologies we use and contribute back to the open source projects and standards we rely on.
pt_br: Como não estamos limitados a padrões, podemos ir além e ampliar suas possibilidades. É claro que o Quarkus não é um consumidor passivo. Nosso objetivo é melhorar e inovar as tecnologias que usamos e contribuir de volta para os projetos e padrões de código aberto nos quais confiamos.

source: Single-step Deployments
pt_br: Implantações de etapa única

source: Size of a consumer's receiver queue. + For example, the number of messages accumulated by a consumer before an application calls `Receive`. + A value higher than the default value increases consumer throughput, though at the expense of more memory utilization.
pt_br: Tamanho da fila de destinatários de um consumidor. + Por exemplo, o número de mensagens acumuladas por um consumidor antes de um aplicativo chamar 'Receber'. + Um valor maior que o valor padrão aumenta a taxa de transferência do consumidor, embora às custas de mais utilização de memória.

source: Skipping class initialization
pt_br: Pulando a inicialização da classe

source: SnapStart uses the CRaC API to allow the application to execute custom code before the snapshotting or during the restoration.
pt_br: O SnapStart utiliza a API CRaC para permitir que a aplicação execute código personalizado antes do _snapshotting_ ou durante a restauração.

source: So join us as we explore how Quarkus helps Java developers everywhere to be more productive, create modern masterpieces and, well, have more fun: 90 odd minutes of technical discussion, some live coding and a Q&A - it’s going to be a blast.
pt_br: Então junte-se a nós enquanto exploramos como o Quarkus ajuda desenvolvedores Java em todos os lugares a serem mais produtivos, criar obras-primas modernas e, bem, se divertir mais: 90 minutos ímpares de discussão técnica, alguma codificação ao vivo e uma sessão de perguntas e respostas - vai ser uma explosão.

source: Solution
pt_br: Solução

source: Sometimes you need more than just handling messages one by one. You can also express your message processing logic using reactive programming as illustrated in the following snippet:
pt_br: Às vezes, você precisa de mais do que apenas lidar com mensagens uma a uma. Você também pode expressar sua lógica de processamento de mensagens usando programação reativa, conforme ilustrado no trecho a seguir:

source: Specify the commit strategy to apply when a message produced from a record is acknowledged. Values can be `ack`, `cumulative`.
pt_br: Especifique a estratégia de confirmação a ser aplicada quando uma mensagem produzida a partir de um registro for reconhecida. Os valores podem ser 'ack', 'cumulativos'.

source: Specify the failure strategy to apply when a message produced from a record is acknowledged negatively (nack). Values can be `nack` (default), `fail`, `ignore` or `reconsume-later
pt_br: Especifique a estratégia de falha a ser aplicada quando uma mensagem produzida a partir de um registro for reconhecida negativamente (nack). Os valores podem ser 'nack' (padrão), 'fail', 'ignore' ou 'reconsume-later

source: Spring Data REST simplifies the creation of CRUD applications based on our Spring Data compatibility layer.
pt_br: O Spring Data REST simplifica a criação de aplicativos CRUD com base em nossa camada de compatibilidade Spring Data.

source: Standards
pt_br: Padrões

source: Start AMQP automatically in dev and test modes.
pt_br: Iniciar o AMQP automaticamente nos modos de desenvolvimento e teste.

source: Start Apache Kafka automatically in dev and test modes.
pt_br: Iniciar o Apache Kafka automaticamente nos modos de desenvolvimento e teste.

source: Start Apicurio Registry automatically in dev and test modes.
pt_br: Iniciar o Apicurio Registry automaticamente nos modos de desenvolvimento e teste.

source: Start Elasticsearch automatically in dev and test modes.
pt_br: Inicie o Elasticsearch automaticamente nos modos de desenvolvimento e teste.

source: Start Keycloak or other providers automatically in dev and test modes.
pt_br: Inicie o Keycloak ou outros provedores automaticamente nos modos de desenvolvimento e teste.

source: Start Kogito automatically in dev and test modes.
pt_br: Inicie o Kogito automaticamente nos modos de desenvolvimento e teste.

source: Start RabbitMQ automatically in dev and test modes.
pt_br: Iniciar o RabbitMQ automaticamente nos modos de desenvolvimento e teste.

source: Start Redis automatically in dev and test modes.
pt_br: Iniciar o Redis automaticamente nos modos de desenvolvimento e teste.

source: Start with Serverless
pt_br: Comece com Serverless

source: Starting and stopping transactions: defining your boundaries
pt_br: Iniciando e interrompendo transações: definindo seus limites

source: Stork Reference
pt_br: Referência do Stork

source: Streamlined code for the 80% common usages, flexible for the 20%
pt_br: Código simplificado para 80% das utilizações comuns, flexível para 20%

source: Subscription name
pt_br: Nome da assinatura

source: Subscription type. + Four subscription types are available: + * Exclusive + * Failover + * Shared + * Key_Shared
pt_br: Tipo de assinatura. + Quatro tipos de assinatura estão disponíveis: + * Exclusive + * Failover + * Shared + * Key_Shared

source: Such a multi-stage build can be achieved as follows:
pt_br: Esta construção em vários estágios pode ser realizada da seguinte forma:

source: Supersonic Subatomic Java
pt_br: Java Subatômico Supersônico

source: Supporting native compilation in C
pt_br: Suporte à compilação nativa em C

source: Switch the working directory to `/work`, which we have mounted in <1>.
pt_br: Mude o diretório de trabalho para `/work`, que foi montado em <1>.

source: Synchronous code on virtual thread
pt_br: Código síncrono em thread virtual

source: Synchronous code on worker thread
pt_br: Código síncrono na worker thread

source: TLS KeyStore type configuration.
pt_br: Configuração do tipo TLS KeyStore.

source: TLS TrustStore type configuration. You need to set this configuration when client authentication is required.
pt_br: Configuração do tipo TLS TrustStore. Você precisa definir essa configuração quando a autenticação do cliente é necessária.

source: Templating with Qute
pt_br: Modelagem com Qute

source: Terminology
pt_br: Terminologia

source: Test the security of your Quarkus applications.
pt_br: Teste a segurança das suas aplicações Quarkus.

source: Testing Your Application
pt_br: Testando a sua aplicação

source: Testing an existing native executable
pt_br: Testar um executável nativo existente

source: Testing the native executable
pt_br: Testando o executável nativo

source: Thanks to the <a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny Reactive API</a> , you can compose asynchronous operations and complete the result when everything is done without blocking the I/O threads. This greatly improves resource consumption and elasticity. Most Quarkus APIs are available in both imperative and reactive. As example, you can use the reactive version of the REST Client:
pt_br: Graças à <a href="https://quarkus.io/version/main/guides/mutiny-primer">Mutiny Reactive API</a> , você pode compor operações assíncronas e concluir o resultado quando tudo for feito sem bloquear os threads de E/S. Isso melhora muito o consumo de recursos e a elasticidade. A maioria das APIs do Quarkus está disponível em imperativa e reativa. Como exemplo, você pode usar a versão reativa do cliente REST:

source: Thanks to their stellar startup time and low memory usage, you can implement functions using Quarkus to be used in serverless environments. Quarkus provides Funqy, an approach to writing functions that are deployable to various FaaS environments like AWS Lambda, Azure Functions, Knative, and Knative Events (Cloud Events). It is also usable as a standalone service.
pt_br: Graças ao seu excelente tempo de inicialização e baixo uso de memória, você pode implementar funções usando o Quarkus para serem usadas em ambientes sem servidor. O Quarkus fornece o Funqy, uma abordagem para escrever funções que podem ser implantadas em vários ambientes FaaS, como AWS Lambda, Azure Functions, Knative, e Knative Events (Cloud Events). Também é utilizável como um serviço independente.

source: That step is particularly not user-friendly. We plan to improve it.
pt_br: Esta etapa é particularmente não é tão fácil de usar. Iremos melhorar este processo em um futuro próximo.

source: The <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>
pt_br: O <a href="https://groups.google.com/d/forum/quarkus-dev" target="_blank">quarkus-dev Google Groups</a>

source: The <a href="https://quarkus.io">English version of quarkus.io</a> is the official project site. Translated sites are community supported on a best-effort basis.
pt_br: A <a href="https://quarkus.io">versão em inglês do quarkus.io</a> é o site oficial do projeto. Os sites traduzidos são suportados pela comunidade com base no melhor esforço.

source: The <code>@Incoming</code> and <code>@Outgoing</code> annotations are part of <a href="https://www.smallrye.io/smallrye-reactive-messaging">Reactive Messaging</a>. They are used to express from which <em>channel</em> you are consuming and to which <em>channel</em> you are sending. Thanks to Reactive Messaging you can consume and send messages from and to different brokers and transports such as HTTP, Kafka, or <a href="http://camel.apache.org">Apache Camel</a>.
pt_br: As anotações<code>@Incoming</code> e <code>@Outgoing</code> fazem parte do <a href="https://www.smallrye.io/smallrye-reactive-messaging">Reactive Messaging</a>. Eles são usados para expressar de qual <em>channel</em> você está consumindo e para qual <em>channel</em> você está enviando. Graças ao Reactive Messaging, você pode consumir e enviar mensagens de e para diferentes brokers e transportes, como HTTP, Kafka ou <a href="http://camel.apache.org">Apache Camel</a>.

source: The Cloud Event mode (`structured` or `binary` (default)). Indicates how are written the cloud events in the outgoing record Type: _string_
pt_br: O modo Cloud Event ('estruturado' ou 'binário' (padrão)). Indica como são gravados os eventos de nuvem no registro de saída Tipo: _string_

source: The Code
pt_br: O Código

source: The Continuation Dance
pt_br: O Processo de Continuação

source: The Pulsar client dns lookup bind address, default behavior is bind on 0.0.0.0
pt_br: O endereço de ligação de pesquisa dns do cliente Pulsar, o comportamento padrão é vincular em 0.0.0.0

source: The Pulsar client dns lookup bind port, takes effect when dnsLookupBindAddress is configured, default value is 0.
pt_br: A porta de ligação de pesquisa dns do cliente Pulsar, entra em vigor quando dnsLookupBindAddress é configurado, o valor padrão é 0.

source: The Pulsar schema type of this channel. When configured a schema is built with the given SchemaType and used for the channel. When absent, the schema is resolved searching for a CDI bean typed `Schema` qualified with `@Identifier` and the channel name. As a fallback AUTO_CONSUME or AUTO_PRODUCE are used.
pt_br: O tipo de esquema Pulsar deste canal. Quando configurado, um esquema é criado com o SchemaType fornecido e usado para o canal. Quando ausente, o esquema é resolvido procurando um bean CDI digitado 'Esquema' qualificado com '@Identifier' e o nome do canal. Como fallback AUTO_CONSUME ou AUTO_PRODUCE são usados.

source: The TLS provider used by an internal client to authenticate with other Pulsar brokers.
pt_br: O provedor TLS usado por um cliente interno para autenticar com outros brokers Pulsar.

source: The URL can now be updated during the deployment or at launch time using system properties or environment variables.
pt_br: A URL agora pode ser atualizada durante a implantação ou no momento da inicialização usando propriedades do sistema ou variáveis de ambiente.

source: The `--enable-preview` flag is not necessary with Java 21.
pt_br: O parâmetro `--enable-preview` não é necessário a partir do Java 21.

source: The `@TransactionConfiguration` annotation allows to set a timeout property, in seconds, that applies to transactions created within the annotated method.
pt_br: A anotação '@TransactionConfiguration' permite definir uma propriedade de tempo limite, em segundos, que se aplica a transações criadas dentro do método anotado.

source: The `Value` attribute is the root URL for your lambda. Copy it to your browser and add `hello` at the end.
pt_br: O atributo `Value` é o URL raiz do seu lambda. Copie-o para o seu navegador e adicione `hello` no final.

source: The `cache:$cache-name:` segment can be configured using the `prefix` property:
pt_br: O `cache:$cache-name:` segmento pode ser configurado utilizando a propriedade `prefix`:

source: The `event` object represents the transaction ID, and defines `toString()`/`equals()`/`hashCode()` accordingly.
pt_br: O objeto `event` representa o ID da transação e define `toString()`/ `equals()`/ `hashCode()` em conformidade.

source: The above example shows a few different ways the API can be used.
pt_br: O exemplo acima mostra algumas maneiras diferentes de usar a API.

source: The above example simulates sending a Cognito principal with an HTTP request to your HTTP Lambda.
pt_br: O exemplo acima simula o envio de uma entidade Cognito com um pedido HTTP para o seu HTTP Lambda.

source: The amount of milliseconds waiting for a graceful shutdown of the Kafka producer Type: _int_
pt_br: A quantidade de milissegundos à espera de um desligamento gracioso do produtor de Kafka Tipo: _int_

source: The backend uses the _<default>_ Redis client (if not configured otherwise), so make sure it's configured (or use the xref:redis-dev-services.adoc[redis dev service])
pt_br: O backend utiliza o cliente Redis por padrão (se não estiver configurado de outra forma), por isso certifique-se de que está configurado (ou utilize o xref:redis-dev-services.adoc[redis dev service])

source: The central idea behind Quarkus is to do at build-time what traditional frameworks do at runtime: configuration parsing, classpath scanning, feature toggle based on classloading, and so on.
pt_br: A ideia central por trás do Quarkus é fazer em tempo de compilação o que as estruturas tradicionais fazem em tempo de execução: análise de configuração, varredura de classpath, alternância de recursos com base no carregamento de classes e assim por diante.

source: The classes to preload are listed in two places:
pt_br: As classes que serão pré-carregadas estão listadas em dois lugares:

source: The code of the application developed in the xref:getting-started.adoc[Getting Started Guide].
pt_br: O código da aplicação desenvolvida no link:getting-started.html[Guia de Iniciação].

source: The combination of Quarkus and Kubernetes provides an ideal environment for creating scalable, fast, and lightweight applications. Quarkus significantly increases developer productivity with tooling, pre-built integrations, application services, and more.
pt_br: A combinação de Quarkus e Kubernetes fornece um ambiente ideal para criar aplicações escaláveis, rápidas e leves. O Quarkus aumenta significativamente a produtividade do desenvolvedor com ferramentas, integrações pré-criadas, serviços de aplicações e muito mais.

source: The consumed / populated Kafka topic. If neither this property nor the `topics` properties are set, the channel name is used Type: _string_
pt_br: O tema Kafka consumido/populado. Se nem essa propriedade nem as propriedades 'topics' estiverem definidas, o nome do canal será usado Tipo: _string_

source: The consumed / populated Pulsar topic. If not set, the channel name is used
pt_br: O tópico Pulsar consumido/povoado. Se não estiver definido, o nome do canal será usado

source: The core foundation of every good open source project is open discussion and collaboration. Quarkus is committed to this belief. We've enabled GitHub Discussions so the community can have open communication. This gives a focal point for the community to ask and answer questions regarding the project. This means all of that great knowledge can be shared and is discoverable. Additionally, other conversations about the Quarkus Community can be had there as well. Come collaborate with us.
pt_br: A base central de todo bom projeto de código aberto é a discussão aberta e a colaboração. O Quarkus está comprometido com essa crença. Ativamos as Discussões do GitHub para que a comunidade possa ter uma comunicação aberta. Isso dá um ponto focal para a comunidade fazer e responder perguntas sobre o projeto. Isso significa que todo esse grande conhecimento pode ser compartilhado e pode ser descoberto. Além disso, outras conversas sobre a Comunidade Quarkus também podem ser feitas lá. Venha colaborar conosco.

source: The default value is 60 seconds.
pt_br: O valor padrão é 60 segundos.
